哈希函数：
哈希函数又叫散列函数，哈希函数性质：
1.典型的哈希函数都拥有无限的输入值域。
2.输入值相同时，返回值一样。
3.输入值不同时，返回值可能一样，也可能不一样。
4.不同输入值得到的哈希值，整体均匀分布在输出域。是评价哈希函数优劣的关键。

解决哈希冲突的三种方法：

1.开放地址法
当冲突发生时，使用某种探查技术在散列表中形成一个探查序列。沿此序列逐个单元地查找，直到找到给定的关键字，或者碰到一个开放的地址(即该地址单元为空)为止（若要插入，在探查到开放的地址，则可将待插入的新结点存人该地址单元）

2.再哈希法
当发生冲突时，使用第二个、第三个、哈希函数计算地址，直到无冲突时。缺点：计算时间增加。
比如上面第一次按照姓首字母进行哈希，如果产生冲突可以按照姓字母首字母第二位进行哈希，再冲突，第三位，直到不冲突为止；

3.拉链发
将所有关键字为同义词的结点链接在同一个单链表中。若选定的散列表长度为m，则可将散列表定义为一个由m个头指针组成的指针数 组T[0..m-1]。凡是散列地址为i的结点，均插入到以T[i]为头指针的单链表中。T中各分量的初值均应为空指针。

拉链法的优点：
1).拉链法处理冲突简单，且无堆积现象，即非同义词决不会发生冲突，因此平均查找长度较短
2).由于拉链法中各链表上的结点空间是动态申请的，故它更适合于造表前无法确定表长的情况
3).开放定址法为减少冲突，要求装填因子α较小，故当结点规模较大时会浪费很多空间。而拉链法中可取α≥1，且结点较大时，拉链法中增加的指针域可忽略不计，因此节省空间
4).在用拉链法构造的散列表中，删除结点的操作易于实现

拉链法的缺点：
1).指针需要额外的空间，故当结点规模较小时，开放定址法较为节省空间。