'''
100张牌，每次只能抽一张，抽过的牌会丢掉，怎么选出最大的牌。
'''



'''
36匹马，6条跑道，选出最快3匹，最少赛多少场
'''
8场。

36匹马分6个组,分别为A、B、C、D、E、F组.
第一轮,每个组各跑一次,取每组前三名,标识为A1、A2、A3,B1、B2、B3,以此类推.

第二轮,每个组的第一名（A1——F1）拉出来跑一次,假设名次是：A1第一名,B1第二名,C1第三名.
则：

1.后三名及其所在组的其余组员均被淘汰（小组头名都没能进前三,当然是全部淘汰啦）
2.两战全胜的A1已经提前夺冠了.
3.由于A1已经占去了一个名额,只剩两个名额了,则B3、C3可以淘汰了.而且由于C1的最好成绩也只能是第三名了,所以C2也可以淘汰了.

第三轮,A2、A3、B1、B2、C1五匹马跑,取前两名.
其中第一轮跑6次,第二轮第三轮都各只跑1次,一共8次.

'''
有两枚硬币A和B，A正面的概率为0.6，B正面的概率为0.5.现在扔了一枚硬币显示为正面.
问：该枚硬币是A的概率是多少？
'''

'''
一道概率题，54张牌，平均分成三堆，大小王在同一堆的概率？
'''
大王在第一堆的概率是1/3, 小王在剩下的53张牌中，有17/53的概率和大王同一堆。依此类推，
大王还可能在2,3堆，因此1/3∗17/53∗3=17/53


'''
在一条高速公路上，在30分钟内看到一辆汽车的可能性是0.95，
那么在10分钟内看到一辆车的概率是多少?（假设过车的概率是恒定的）
'''
记10分钟内看到车的概率为p. 那么30分钟都没看到车的概率是(1−p)^3=1−0.95=0.05
所以p=1−0.05^(1/3)


'''
买饮料，三个瓶盖可以换一瓶，请问要买100瓶饮料，最少需要买多少瓶？
'''
n=log3x
x(1−1/3n)/(1−1/3)>=100
x(1−1/x)>=200/3
x=68
x=69


'''
给定rand5()，实现一个方法rand7()。
也即，给定一个产生0到4（含）随机数方法，编写一个产生0到6（含）随机数的方法。
'''

随机数函数的关键是确保产生每一个数的的概率相等。
我们可用通过5 * rand5() + rand5()产生[0:24]，
舍弃[21:24]，最后除以7取余数，则可得到概率相等的[0:6]的数值.

'''
一个桶里面有白球、黑球各100个，现在按下述规则取球：
- i 、每次从桶里面拿出来两个球；
- ii、如果取出的是两个同色的求，就再放入一个黑球；
- iii、如果取出的是两个异色的求，就再放入一个白球。
问：最后桶里面只剩下一个黑球的概率是多少？
'''
动态规划，令f[i,j]表示有i个白球，j个黑球的概率。
已知f[100,100] = 1, 求f[0,1]。
拿到两个白球: f[i-2,j+1] = i/(i+j) * (i-1)/(i+j-1) * f[i,j]
拿到两个黑球: f[i, j-1] = j/(i+j) * (j-1)/(i+j-1) * f[i,j]
拿到一黑一白: f[i, j-1] =2 * i/(i+j) * j/(i+j-1) * f[i,j]
